Repository: edly-io/h5pxblock
Catalog: h5pxblock/locale/*/LC_MESSAGES/text.po
Languages: ar, es_es, fa, pt_pt

source: Not attempted
fa: تلاش نشده
pt_pt: Não tentado

source: Completed
fa: تکمیل شد
pt_pt: Concluído

source: H5P Player Id
ar: معرف المشغل H5P
es_es: ID del reproductor H5P
fa: شناسه پخش‌کننده H5P
pt_pt: ID do reprodutor H5P

source: Unique ID for player instance
ar: معرف فريد لنسخة المشغل
es_es: ID único para la instancia del reproductor
fa: شناسه یکتای نمونه پخش‌کننده
pt_pt: ID único da instância de reprodução

source: Display Name
ar: اسم العرض
es_es: Nombre para mostrar
fa: نام نمایش
pt_pt: Nome de apresentação

source: Display name for this module
ar: اسم العرض لهذا النموذج
es_es: Nombre para mostrar para este módulo
fa: نام نمایشی برای این ماژول
pt_pt: Nome de apresentação para este módulo

source: Upload H5P content
ar: للرفع (تحميل) محتوى H5P
es_es: Subir contenido H5P
fa: بارگذاری محتوای H5P

source: Show H5P player frame
ar: عرض إطار المشغل H5P
es_es: Mostrar marco del reproductor H5P
fa: نمایش فریم پخش‌کننده H5P
pt_pt: Carregar conteúdo H5P

source: whether to show H5P player frame and button
ar: ما إذا كان ينبغي عرض إطار وزر المشغل H5P
es_es: Si se debe mostrar el marco y el botón del reproductor H5P
fa: آیا فریم و دکمه پخش‌کننده H5P نشان داده شود
pt_pt: se deve mostrar a moldura e o botão do leitor H5P

source: Show copyright button
ar: عرض زر حقوق التأليف والنشر
es_es: Mostrar botón de derechos de autor
fa: نمایش دکمه حق نشر
pt_pt: Botão Mostrar direitos de autor

source: whether to show copyright button
ar: ما إذا كان ينبغي عرض زر حقوق التأليف والنشر
es_es: Si se debe mostrar el botón de derechos de autor
fa: آیا دکمه حق نشر نشان داده شود
pt_pt: se deve ser mostrado o botão de direitos de autor

source: Show h5p icon
ar: عرض أيقونة h5p
es_es: Mostrar icono h5p
fa: نمایش آیکون h5p
pt_pt: Mostrar ícone h5p

source: whether to show h5p icon
ar: ما إذا كان ينبغي عرض أيقونة h5p
es_es: Si se debe mostrar el icono h5p
fa: آیا آیکون h5p نشان داده شود
pt_pt: se deve mostrar o ícone h5p

source: Show fullscreen button
ar: عرض زر (ملء الشاشة)
es_es: Mostrar botón de pantalla completa
fa: نمایش دکمه تمام‌صفحه
pt_pt: Mostrar botão de ecrã completo

source: whether to show fullscreen button
ar: ما إذا كان ينبغي عرض زر (ملء الشاشة)
es_es: Si se debe mostrar el botón de pantalla completa
fa: آیا دکمه تمام‌صفحه نشان داده شود
pt_pt: se deve ser mostrado o botão de ecrã inteiro

source: Is Scorable
ar: قابل للتخزين / للحفظ
es_es: ¿Es puntuable?
fa: قابل نمره‌دهی است
pt_pt: É pontual

source: Select True if this component will save score
ar: اختر صحيح إذا كان المكون سيحتفظ بالنتيجة
es_es: Seleccione Verdadero si este componente guardará la puntuación
fa: اگر این بخش نمره را ذخیره می‌کند، صحیح را انتخاب کنید
pt_pt: Selecione Verdadeiro se este componente guarda pontuação

source: User content state save frequency
ar: تكرار حفظ حالة محتوى المستخدم
es_es: Frecuencia de guardado del estado del contenido del usuario
fa: تناوب ذخیره‌سازی حالت محتوای کاربر
pt_pt: Frequência de gravação do estado do conteúdo do utilizador

source: How often current user content state should be autosaved (in seconds). Set it to zero if you don't want to save content state.
ar: كم مرة يجب حفظ حالة محتوى المستخدم الحالية (بالثواني) تلقائيًا. قم بتعيينها على الصفر إذا كنت لا تريد حفظ حالة المحتوى.
es_es: Con qué frecuencia se debe guardar automáticamente el estado actual del contenido del usuario (en segundos). Establézcalo en cero si no desea guardar el estado del contenido.
fa: چند وقت یک‌بار حالت محتوای کاربر به‌صورت خودکار ذخیره شود (به ثانیه). اگر نمی‌خواهید حالت محتوا ذخیره شود، آن را روی صفر تنظیم کنید.
pt_pt: Com que frequência o estado atual do conteúdo do utilizador deve ser guardado automaticamente (em segundos). Defina-o como zero se não pretender guardar o estado do conteúdo.

source: User previous content interaction states
ar: حالات تفاعل المحتوى السابق للمستخدم
es_es: Estados previos de interacción del contenido por parte del usuario
fa: حالت‌های تعامل محتوای قبلی کاربر
pt_pt: Estados de interação de conteúdos anteriores do utilizador

source: Problem Weight
es_es: Peso del problema
fa: وزن مسئله
pt_pt: Peso do problema

source: Defines the number of points this problem is worth. If the value is not set, the problem is worth one point.
es_es: Define el número de puntos que vale este problema. Si no se establece el valor, el problema vale un punto.
fa: تعداد امتیازاتی که این مسئله ارزش دارد را تعیین می‌کند. اگر مقدار تنظیم نشود، مسئله یک امتیاز ارزش دارد.
pt_pt: Define o número de pontos que este problema vale. Se o valor não for definido, o problema vale um ponto.

source: Maximum score
es_es: Puntaje máximo
fa: حداکثر نمره
pt_pt: Pontuação máxima

source: Maximum grade score given to assignment by staff.
es_es: Calificación máxima dada a la tarea por el instructor.
fa: حداکثر نمره‌ای که توسط کارکنان به تکلیف داده می‌شود.
pt_pt: Nota máxima atribuída a um trabalho pelo pessoal.

source: Problem weighted score
fa: نمره وزن‌دار مسئله
pt_pt: Pontuação ponderada do problema

source: Defines the weighted score of this problem. If the value is not set, the problem is worth one point.
fa: نمره وزن‌دار این مسئله را تعیین می‌کند. اگر مقدار تنظیم نشود، مسئله یک امتیاز ارزش دارد.
pt_pt: Define a pontuação ponderada deste problema. Se o valor não for definido, o problema vale um ponto.

source: Submission status
fa: وضعیت ارسال
pt_pt: Estado da submissão

source: The submission status of the assignment.
fa: وضعیت ارسال تکلیف.
pt_pt: O estado de submissão da tarefa.

source: Uploading
ar: جاري الرفع
es_es: Subiendo
fa: در حال بارگذاری
pt_pt: Carregando

source: Uploaded
ar: تم الرفع
es_es: Subido
fa: بارگذاری شده
pt_pt: Carregado

source: Extracting
ar: جاري الاستخلاص
es_es: Extrayendo
fa: در حال استخراج
pt_pt: Extraindo

source: points
fa: امتیازات
pt_pt: pontos

source: Loading...
ar: جاري التحميل ...
es_es: Cargando...
fa: در حال بارگذاری...
pt_pt: Carregando...

source: The due date for this subsection has passed. Your response will be recorded, but not graded.
es_es: La fecha de vencimiento de esta subsección ha pasado. Su respuesta será registrada, pero no calificada.
fa: تاریخ موعد این بخش گذشته است. پاسخ شما ثبت خواهد شد، اما نمره‌گذاری نمی‌شود.
pt_pt: A data limite para esta subsecção já passou. A sua resposta será registada, mas não será avaliada.

source: No content. Please upload H5P content.
ar: لا يوجد محتوى. يرجى رفع محتوى H5P
es_es: No hay contenido. Por favor, suba contenido de H5P.
fa: محتوایی وجود ندارد. لطفاً محتوای H5P بارگذاری کنید.
pt_pt: Sem conteúdo. Carregar conteúdo H5P

source: Currently:
ar: حاليًا:
es_es: Actualmente:
fa: در حال حاضر:
pt_pt: Atualmente:

source: Upload time:
ar: وقت الرفع
es_es: Tiempo de subida:
fa: زمان بارگذاری:
pt_pt: Tempo de carregamento:

source: Reuse Existing H5P Content
ar: إعادة استخدام محتوى H5P الحالي
es_es: Reutilizar contenido H5P existente
fa: استفاده مجدد از محتوای موجود H5P
pt_pt: Reutilizar conteúdos H5P existentes

source: Enter path of existing content or copy path to reuse this content in another block
ar: أدخل مسار المحتوى الحالي أو قم بنسخ المسار لإعادة استخدام هذا المحتوى في كتلة أخرى
es_es: Introduzca la ruta del contenido existente o copie la ruta para reutilizar este contenido en otro bloque
fa: مسیر محتوای موجود را وارد کنید یا مسیر را کپی کنید تا این محتوا در بلاک دیگری استفاده شود
pt_pt: Introduzir o caminho do conteúdo existente ou copiar o caminho para reutilizar este conteúdo noutro bloco

source: True
ar: صحيح
es_es: Verdadero
fa: صحیح
pt_pt: Verdadeiro

source: (Default)
ar: (افتراضي)
es_es: (Predeterminado)
fa: (پیش‌فرض)
pt_pt: (Predefinição)

source: False
ar: خاطئ
es_es: Falso
fa: غلط
pt_pt: Falso

source: Save
ar: حفظ
es_es: Guardar
fa: ذخیره
pt_pt: Guardar

source: Cancel
ar: إلغاء
es_es: Cancelar
fa: لغو
pt_pt: Cancelar
